demo_dialog/src/InformationRegisters/DialogDemoUsers/DialogDemoUsers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DialogDemoUsers</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>user</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

demo_dialog/src/InformationRegisters/DialogDemoUsers/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Пользователь(user) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	DialogDemoUsers.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.DialogDemoUsers КАК DialogDemoUsers
	|ГДЕ
	|	DialogDemoUsers.user = &user";
	Запрос.УстановитьПараметр("user", user);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
	Иначе
		Пользователь = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Пользователь;
	
КонецФункции

#КонецОбласти

#КонецЕсли
